perf-results/merged.yml
---
execution:
- concurrency: 20
  hold-for: 1m
  ramp-up: 30s
  scenario: api-load-test
modules:
  jmeter:
    version: 5.6.3
reporting:
- dump-csv: stats.csv
  module: final-stats
  summary: true
- criteria:
  - avg-rt > 500ms for 10s, continue as non-failing
  - fail > 5% for 10s, continue as non-failing
  module: passfail
scenarios:
  api-load-test:
    default-address: https://reqres.in
    headers:
      x-api-key: free_user_3FV2fJGmFELswbMj91CZsT6vXxA
    requests:
    - assert:
      - contains:
        - 200
        not: false
        subject: http-code
      method: GET
      url: /api/users?page=2
    - assert:
      - contains:
        - 201
        not: false
        subject: http-code
      body: '{"name": "test_user", "job": "leader"}'
      headers:
        Content-Type: application/json
      method: POST
      url: /api/users
    - assert:
      - contains:
        - 200
        not: false
        subject: http-code
      body: '{"name": "morpheus", "job": "zion resident"}'
      headers:
        Content-Type: application/json
      method: PUT
      url: /api/users/2
    - assert:
      - contains:
        - 204
        not: false
        subject: http-code
      method: DELETE
      url: /api/users/2
    - assert:
      - contains:
        - 200
        not: false
        subject: http-code
      method: GET
      url: /api/unknown
    - assert:
      - contains:
        - 404
        not: false
        subject: http-code
      method: GET
      url: https://dequeuniversity.com/demo/mars/